MCUdude/MiniCore/avr/boards.txt
328.menu.clock.8MHz_internal=Internal 8 MHz
328.menu.clock.8MHz_internal.upload.default_speed=38400
328.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
328.menu.clock.8MHz_internal.build.clkpr=
328.menu.clock.8MHz_internal.build.f_cpu=8000000L

328.menu.clock.4MHz_internal=Internal 4 MHz
328.menu.clock.4MHz_internal.upload.default_speed=9600
328.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
328.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
328.menu.clock.4MHz_internal.build.f_cpu=4000000L

328.menu.clock.2MHz_internal=Internal 2 MHz
328.menu.clock.2MHz_internal.upload.default_speed=9600
328.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
328.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
328.menu.clock.2MHz_internal.build.f_cpu=2000000L

328.menu.clock.1MHz_internal=Internal 1 MHz
328.menu.clock.1MHz_internal.upload.default_speed=9600
328.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
328.menu.clock.1MHz_internal.build.clkpr=
328.menu.clock.1MHz_internal.build.f_cpu=1000000L


#############################
#### ATmega168/A/P/PA/PB ####
#############################

# General
168.name=ATmega168
168.upload.tool=avrdude
168.upload.maximum_size=15872
168.upload.maximum_data_size=1024
168.bootloader.tool=avrdude
168.bootloader.unlock_bits=0xff
168.bootloader.lock_bits=0xff
168.bootloader.extended_fuses=0xff
168.build.core=MCUdude_corefiles
168.build.board=AVR_ATmega168
168.build.bootloader_led=led+b5
168.build.extra_flags={build.clkpr}

# Upload port select
168.menu.bootloader.uart0=Yes (UART0)
168.menu.bootloader.uart0.upload.maximum_size=16000
168.menu.bootloader.uart0.upload.protocol=urclock
168.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
168.menu.bootloader.uart0.build.export_merged_output=true
168.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

168.menu.bootloader.no_bootloader=No bootloader
168.menu.bootloader.no_bootloader.upload.maximum_size=16384
168.menu.bootloader.no_bootloader.build.export_merged_output=false
168.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
168.menu.eeprom.keep=EEPROM retained
168.menu.eeprom.keep.bootloader.eesave_bit=0
168.menu.eeprom.erase=EEPROM not retained
168.menu.eeprom.erase.bootloader.eesave_bit=1

# Baud rate
168.menu.baudrate.default=Default
168.menu.baudrate.default.upload.speed={upload.default_speed}
168.menu.baudrate.1000000=1000000
168.menu.baudrate.1000000.upload.speed=1000000
168.menu.baudrate.500000=500000
168.menu.baudrate.500000.upload.speed=500000
168.menu.baudrate.460800=460800
168.menu.baudrate.460800.upload.speed=460800
168.menu.baudrate.250000=250000
168.menu.baudrate.250000.upload.speed=250000
168.menu.baudrate.230400=230400
168.menu.baudrate.230400.upload.speed=230400
168.menu.baudrate.125000=125000
168.menu.baudrate.125000.upload.speed=125000
168.menu.baudrate.115200=115200
168.menu.baudrate.115200.upload.speed=115200
168.menu.baudrate.57600=57600
168.menu.baudrate.57600.upload.speed=57600
168.menu.baudrate.38400=38400
168.menu.baudrate.38400.upload.speed=38400
168.menu.baudrate.19200=19200
168.menu.baudrate.19200.upload.speed=19200
168.menu.baudrate.9600=9600
168.menu.baudrate.9600.upload.speed=9600
168.menu.baudrate.4800=4800
168.menu.baudrate.4800.upload.speed=4800

# Variants
168.menu.variant.modelP=168P / 168PA
168.menu.variant.modelP.bootloader.cksel_bits=0111
168.menu.variant.modelP.build.variant=standard
168.menu.variant.modelP.build.mcu=atmega168p

168.menu.variant.modelNonP=168 / 168A
168.menu.variant.modelNonP.bootloader.cksel_bits=0111
168.menu.variant.modelNonP.build.variant=standard
168.menu.variant.modelNonP.build.mcu=atmega168

168.menu.variant.modelPB=168PB
168.menu.variant.modelPB.bootloader.cksel_bits=1111
168.menu.variant.modelPB.build.variant=pb-variant
168.menu.variant.modelPB.build.mcu=atmega168pb

# Brown out detection
168.menu.BOD.2v7=BOD 2.7V
168.menu.BOD.2v7.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
168.menu.BOD.4v3=BOD 4.3V
168.menu.BOD.4v3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
168.menu.BOD.1v8=BOD 1.8V
168.menu.BOD.1v8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
168.menu.BOD.disabled=BOD disabled
168.menu.BOD.disabled.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111

# Compiler link time optimization
168.menu.LTO.Os_flto=LTO Enabled
168.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
168.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
168.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
168.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

168.menu.LTO.Os=LTO Disabled
168.menu.LTO.Os.compiler.c.extra_flags=
168.menu.LTO.Os.compiler.c.elf.extra_flags=
168.menu.LTO.Os.compiler.cpp.extra_flags=
168.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
168.menu.clock.16MHz_external=External 16 MHz
168.menu.clock.16MHz_external.upload.default_speed=115200
168.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.16MHz_external.build.clkpr=
168.menu.clock.16MHz_external.build.f_cpu=16000000L

168.menu.clock.20MHz_external=External 20 MHz
168.menu.clock.20MHz_external.upload.default_speed=115200
168.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.20MHz_external.build.clkpr=
168.menu.clock.20MHz_external.build.f_cpu=20000000L

168.menu.clock.18_432MHz_external=External 18.432 MHz
168.menu.clock.18_432MHz_external.upload.default_speed=115200
168.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.18_432MHz_external.build.clkpr=
168.menu.clock.18_432MHz_external.build.f_cpu=18432000L

168.menu.clock.14_7456MHz_external=External 14.7456 MHz
168.menu.clock.14_7456MHz_external.upload.default_speed=115200
168.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.14_7456MHz_external.build.clkpr=
168.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

168.menu.clock.12MHz_external=External 12 MHz
168.menu.clock.12MHz_external.upload.default_speed=57600
168.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.12MHz_external.build.clkpr=
168.menu.clock.12MHz_external.build.f_cpu=12000000L

168.menu.clock.11_0592MHz_external=External 11.0592 MHz
168.menu.clock.11_0592MHz_external.upload.default_speed=115200
168.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.11_0592MHz_external.build.clkpr=
168.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

168.menu.clock.8MHz_external=External 8 MHz
168.menu.clock.8MHz_external.upload.default_speed=57600
168.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.8MHz_external.build.clkpr=
168.menu.clock.8MHz_external.build.f_cpu=8000000L

