MCUdude/MiniCore/avr/boards.txt
168.menu.clock.7_3728MHz_external=External 7.3728 MHz
168.menu.clock.7_3728MHz_external.upload.default_speed=115200
168.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.7_3728MHz_external.build.clkpr=
168.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

168.menu.clock.6MHz_external=External 6 MHz
168.menu.clock.6MHz_external.upload.default_speed=57600
168.menu.clock.6MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.6MHz_external.build.clkpr=
168.menu.clock.6MHz_external.build.f_cpu=6000000L

168.menu.clock.4MHz_external=External 4 MHz
168.menu.clock.4MHz_external.upload.default_speed=9600
168.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.4MHz_external.build.clkpr=
168.menu.clock.4MHz_external.build.f_cpu=4000000L

168.menu.clock.3_6864MHz_external=External 3.6864 MHz
168.menu.clock.3_6864MHz_external.upload.default_speed=115200
168.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.3_6864MHz_external.build.clkpr=
168.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

168.menu.clock.2MHz_external=External 2 MHz
168.menu.clock.2MHz_external.upload.default_speed=9600
168.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.2MHz_external.build.clkpr=
168.menu.clock.2MHz_external.build.f_cpu=2000000L

168.menu.clock.1_8432MHz_external=External 1.8432 MHz
168.menu.clock.1_8432MHz_external.upload.default_speed=115200
168.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.1_8432MHz_external.build.clkpr=
168.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

168.menu.clock.1MHz_external=External 1 MHz
168.menu.clock.1MHz_external.upload.default_speed=9600
168.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.1MHz_external.build.clkpr=
168.menu.clock.1MHz_external.build.f_cpu=1000000L

168.menu.clock.8MHz_internal=Internal 8 MHz
168.menu.clock.8MHz_internal.upload.default_speed=38400
168.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.8MHz_internal.build.clkpr=
168.menu.clock.8MHz_internal.build.f_cpu=8000000L

168.menu.clock.4MHz_internal=Internal 4 MHz
168.menu.clock.4MHz_internal.upload.default_speed=9600
168.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
168.menu.clock.4MHz_internal.build.f_cpu=4000000L

168.menu.clock.2MHz_internal=Internal 2 MHz
168.menu.clock.2MHz_internal.upload.default_speed=9600
168.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
168.menu.clock.2MHz_internal.build.f_cpu=2000000L

168.menu.clock.1MHz_internal=Internal 1 MHz
168.menu.clock.1MHz_internal.upload.default_speed=9600
168.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
168.menu.clock.1MHz_internal.build.clkpr=
168.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################
#### ATmega88/A/P/PA/PB ####
############################

# General
88.name=ATmega88
88.upload.tool=avrdude
88.upload.maximum_data_size=1024
88.bootloader.tool=avrdude
88.bootloader.unlock_bits=0xff
88.bootloader.lock_bits=0xff
88.bootloader.extended_fuses=0xff
88.build.core=MCUdude_corefiles
88.build.board=AVR_ATmega88
88.build.bootloader_led=led+b5
88.build.extra_flags={build.clkpr}

# Upload port select
88.menu.bootloader.uart0=Yes (UART0)
88.menu.bootloader.uart0.upload.maximum_size=7808
88.menu.bootloader.uart0.upload.protocol=urclock
88.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
88.menu.bootloader.uart0.build.export_merged_output=true
88.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

88.menu.bootloader.no_bootloader=No bootloader
88.menu.bootloader.no_bootloader.upload.maximum_size=8192
88.menu.bootloader.no_bootloader.build.export_merged_output=false
88.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
88.menu.eeprom.keep=EEPROM retained
88.menu.eeprom.keep.bootloader.eesave_bit=0
88.menu.eeprom.erase=EEPROM not retained
88.menu.eeprom.erase.bootloader.eesave_bit=1

# Baud rate
88.menu.baudrate.default=Default
88.menu.baudrate.default.upload.speed={upload.default_speed}
88.menu.baudrate.1000000=1000000
88.menu.baudrate.1000000.upload.speed=1000000
88.menu.baudrate.500000=500000
88.menu.baudrate.500000.upload.speed=500000
88.menu.baudrate.460800=460800
88.menu.baudrate.460800.upload.speed=460800
88.menu.baudrate.250000=250000
88.menu.baudrate.250000.upload.speed=250000
88.menu.baudrate.230400=230400
88.menu.baudrate.230400.upload.speed=230400
88.menu.baudrate.125000=125000
88.menu.baudrate.125000.upload.speed=125000
88.menu.baudrate.115200=115200
88.menu.baudrate.115200.upload.speed=115200
88.menu.baudrate.57600=57600
88.menu.baudrate.57600.upload.speed=57600
88.menu.baudrate.38400=38400
88.menu.baudrate.38400.upload.speed=38400
88.menu.baudrate.19200=19200
88.menu.baudrate.19200.upload.speed=19200
88.menu.baudrate.9600=9600
88.menu.baudrate.9600.upload.speed=9600
88.menu.baudrate.4800=4800
88.menu.baudrate.4800.upload.speed=4800

# Variants
88.menu.variant.modelP=88P / 88PA
88.menu.variant.modelP.bootloader.cksel_bits=0111
88.menu.variant.modelP.build.variant=standard
88.menu.variant.modelP.build.mcu=atmega88p

88.menu.variant.modelNonP=88 / 88A
88.menu.variant.modelNonP.bootloader.cksel_bits=0111
88.menu.variant.modelNonP.build.variant=standard
88.menu.variant.modelNonP.build.mcu=atmega88

88.menu.variant.modelPB=88PB
88.menu.variant.modelPB.bootloader.cksel_bits=1111
88.menu.variant.modelPB.build.variant=pb-variant
88.menu.variant.modelPB.build.mcu=atmega88pb

# Brown out detection
88.menu.BOD.2v7=BOD 2.7V
88.menu.BOD.2v7.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
88.menu.BOD.4v3=BOD 4.3V
88.menu.BOD.4v3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
88.menu.BOD.1v8=BOD 1.8V
88.menu.BOD.1v8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
88.menu.BOD.disabled=BOD Disabled
88.menu.BOD.disabled.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111

# Compiler link time optimization
88.menu.LTO.Os_flto=LTO Enabled
88.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
88.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
88.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
88.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

