MCUdude/MiniCore/avr/boards.txt
88.menu.LTO.Os=LTO Disabled
88.menu.LTO.Os.compiler.c.extra_flags=
88.menu.LTO.Os.compiler.c.elf.extra_flags=
88.menu.LTO.Os.compiler.cpp.extra_flags=
88.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
88.menu.clock.16MHz_external=External 16 MHz
88.menu.clock.16MHz_external.upload.default_speed=115200
88.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.16MHz_external.build.clkpr=
88.menu.clock.16MHz_external.build.f_cpu=16000000L

88.menu.clock.20MHz_external=External 20 MHz
88.menu.clock.20MHz_external.upload.default_speed=115200
88.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.20MHz_external.build.clkpr=
88.menu.clock.20MHz_external.build.f_cpu=20000000L

88.menu.clock.18_432MHz_external=External 18.432 MHz
88.menu.clock.18_432MHz_external.upload.default_speed=115200
88.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.18_432MHz_external.build.clkpr=
88.menu.clock.18_432MHz_external.build.f_cpu=18432000L

88.menu.clock.14_7456MHz_external=External 14.7456 MHz
88.menu.clock.14_7456MHz_external.upload.default_speed=115200
88.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.14_7456MHz_external.build.clkpr=
88.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

88.menu.clock.12MHz_external=External 12 MHz
88.menu.clock.12MHz_external.upload.default_speed=57600
88.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.12MHz_external.build.clkpr=
88.menu.clock.12MHz_external.build.f_cpu=12000000L

88.menu.clock.11_0592MHz_external=External 11.0592 MHz
88.menu.clock.11_0592MHz_external.upload.default_speed=115200
88.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.11_0592MHz_external.build.clkpr=
88.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

88.menu.clock.8MHz_external=External 8 MHz
88.menu.clock.8MHz_external.upload.default_speed=57600
88.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.8MHz_external.build.clkpr=
88.menu.clock.8MHz_external.build.f_cpu=8000000L

88.menu.clock.7_3728MHz_external=External 7.3728 MHz
88.menu.clock.7_3728MHz_external.upload.default_speed=115200
88.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.7_3728MHz_external.build.clkpr=
88.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

88.menu.clock.6MHz_external=External 6 MHz
88.menu.clock.6MHz_external.upload.default_speed=57600
88.menu.clock.6MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.6MHz_external.build.clkpr=
88.menu.clock.6MHz_external.build.f_cpu=6000000L

88.menu.clock.4MHz_external=External 4 MHz
88.menu.clock.4MHz_external.upload.default_speed=9600
88.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.4MHz_external.build.clkpr=
88.menu.clock.4MHz_external.build.f_cpu=4000000L

88.menu.clock.3_6864MHz_external=External 3.6864 MHz
88.menu.clock.3_6864MHz_external.upload.default_speed=115200
88.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.3_6864MHz_external.build.clkpr=
88.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

88.menu.clock.2MHz_external=External 2 MHz
88.menu.clock.2MHz_external.upload.default_speed=9600
88.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.2MHz_external.build.clkpr=
88.menu.clock.2MHz_external.build.f_cpu=2000000L

88.menu.clock.1_8432MHz_external=External 1.8432 MHz
88.menu.clock.1_8432MHz_external.upload.default_speed=115200
88.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.1_8432MHz_external.build.clkpr=
88.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

88.menu.clock.1MHz_external=External 1 MHz
88.menu.clock.1MHz_external.upload.default_speed=9600
88.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.1MHz_external.build.clkpr=
88.menu.clock.1MHz_external.build.f_cpu=1000000L

88.menu.clock.8MHz_internal=Internal 8 MHz
88.menu.clock.8MHz_internal.upload.default_speed=38400
88.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.8MHz_internal.build.clkpr=
88.menu.clock.8MHz_internal.build.f_cpu=8000000L

88.menu.clock.4MHz_internal=Internal 4 MHz
88.menu.clock.4MHz_internal.upload.default_speed=9600
88.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
88.menu.clock.4MHz_internal.build.f_cpu=4000000L

88.menu.clock.2MHz_internal=Internal 2 MHz
88.menu.clock.2MHz_internal.upload.default_speed=9600
88.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
88.menu.clock.2MHz_internal.build.f_cpu=2000000L

88.menu.clock.1MHz_internal=Internal 1 MHz
88.menu.clock.1MHz_internal.upload.default_speed=9600
88.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
88.menu.clock.1MHz_internal.build.clkpr=
88.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################
#### ATmega48/A/P/PA/PB ####
############################

# General
48.name=ATmega48
48.upload.tool=avrdude
48.upload.maximum_data_size=512
48.bootloader.tool=avrdude
48.bootloader.unlock_bits=0xff
48.bootloader.lock_bits=0xff
48.bootloader.extended_fuses=0xff
48.build.core=MCUdude_corefiles
48.build.board=AVR_ATmega48
48.build.bootloader_led=led+b5
48.build.extra_flags={build.clkpr}

# Upload port select
48.menu.bootloader.uart0=Yes (UART0)
48.menu.bootloader.uart0.upload.maximum_size=3776
48.menu.bootloader.uart0.upload.protocol=urclock
48.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
48.menu.bootloader.uart0.build.export_merged_output=true
48.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

48.menu.bootloader.no_bootloader=No bootloader
48.menu.bootloader.no_bootloader.upload.maximum_size=4096
48.menu.bootloader.no_bootloader.build.export_merged_output=false
48.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
48.menu.eeprom.keep=EEPROM retained
48.menu.eeprom.keep.bootloader.eesave_bit=0
48.menu.eeprom.erase=EEPROM not retained
48.menu.eeprom.erase.bootloader.eesave_bit=1

# Baud rate
48.menu.baudrate.default=Default
48.menu.baudrate.default.upload.speed={upload.default_speed}
48.menu.baudrate.1000000=1000000
48.menu.baudrate.1000000.upload.speed=1000000
48.menu.baudrate.500000=500000
48.menu.baudrate.500000.upload.speed=500000
48.menu.baudrate.460800=460800
48.menu.baudrate.460800.upload.speed=460800
48.menu.baudrate.250000=250000
48.menu.baudrate.250000.upload.speed=250000
48.menu.baudrate.230400=230400
48.menu.baudrate.230400.upload.speed=230400
48.menu.baudrate.125000=125000
48.menu.baudrate.125000.upload.speed=125000
48.menu.baudrate.115200=115200
48.menu.baudrate.115200.upload.speed=115200
48.menu.baudrate.57600=57600
48.menu.baudrate.57600.upload.speed=57600
48.menu.baudrate.38400=38400
48.menu.baudrate.38400.upload.speed=38400
48.menu.baudrate.19200=19200
48.menu.baudrate.19200.upload.speed=19200
48.menu.baudrate.9600=9600
48.menu.baudrate.9600.upload.speed=9600
48.menu.baudrate.4800=4800
48.menu.baudrate.4800.upload.speed=4800

